benchmark/logs/openebs-hostpath.log
Working dir: /tmp

Testing Read IOPS...
read_iops: (g=0): rw=randread, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=64
fio-2.17-45-g06cb
Starting 1 process
read_iops: Laying out IO file(s) (1 file(s) / 2048MiB)

read_iops: (groupid=0, jobs=1): err= 0: pid=11: Sat May  6 06:02:59 2023
   read: IOPS=4293, BW=16.9MiB/s (17.7MB/s)(252MiB/15018msec)
  cpu          : usr=0.59%, sys=1.11%, ctx=57059, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=120.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=64473,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=16.9MiB/s (17.7MB/s), 16.9MiB/s-16.9MiB/s (17.7MB/s-17.7MB/s), io=252MiB (264MB), run=15018-15018msec

Disk stats (read/write):
  nvme1n1: ios=77742/4, merge=0/1, ticks=1084810/50, in_queue=1084860, util=99.31%


Testing Write IOPS...
write_iops: (g=0): rw=randwrite, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=64
fio-2.17-45-g06cb
Starting 1 process

write_iops: (groupid=0, jobs=1): err= 0: pid=21: Sat May  6 06:03:17 2023
  write: IOPS=4295, BW=16.9MiB/s (17.7MB/s)(252MiB/15023msec)
  cpu          : usr=0.35%, sys=1.37%, ctx=44842, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=116.1%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=0,64531,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=16.9MiB/s (17.7MB/s), 16.9MiB/s-16.9MiB/s (17.7MB/s-17.7MB/s), io=252MiB (265MB), run=15023-15023msec

Disk stats (read/write):
  nvme1n1: ios=3/74956, merge=0/3, ticks=57/1086247, in_queue=1086304, util=99.42%


Testing Read Bandwidth...
read_bw: (g=0): rw=randread, bs=128KiB-128KiB,128KiB-128KiB,128KiB-128KiB, ioengine=libaio, iodepth=64
fio-2.17-45-g06cb
Starting 1 process

read_bw: (groupid=0, jobs=1): err= 0: pid=31: Sat May  6 06:03:34 2023
   read: IOPS=1155, BW=145MiB/s (152MB/s)(2184MiB/15057msec)
  cpu          : usr=0.13%, sys=0.71%, ctx=17007, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=120.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=17405,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=145MiB/s (152MB/s), 145MiB/s-145MiB/s (152MB/s-152MB/s), io=2184MiB (2290MB), run=15057-15057msec

Disk stats (read/write):
  nvme1n1: ios=20989/3, merge=0/1, ticks=1086135/161, in_queue=1086295, util=99.41%


Testing Write Bandwidth...
write_bw: (g=0): rw=randwrite, bs=128KiB-128KiB,128KiB-128KiB,128KiB-128KiB, ioengine=libaio, iodepth=64
fio-2.17-45-g06cb
Starting 1 process

write_bw: (groupid=0, jobs=1): err= 0: pid=41: Sat May  6 06:03:52 2023
  write: IOPS=1155, BW=145MiB/s (152MB/s)(2185MiB/15066msec)
  cpu          : usr=0.82%, sys=0.72%, ctx=12781, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=116.1%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=0,17415,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=145MiB/s (152MB/s), 145MiB/s-145MiB/s (152MB/s-152MB/s), io=2185MiB (2291MB), run=15066-15066msec

Disk stats (read/write):
  nvme1n1: ios=3/20216, merge=0/3, ticks=166/1081950, in_queue=1082116, util=99.42%


Testing Read Latency...
read_latency: (g=0): rw=randread, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=4
fio-2.17-45-g06cb
Starting 1 process

read_latency: (groupid=0, jobs=1): err= 0: pid=51: Sat May  6 06:04:09 2023
   read: IOPS=4297, BW=16.9MiB/s (17.7MB/s)(252MiB/15008msec)
    slat (usec): min=1, max=3208, avg= 1.78, stdev=11.66
    clat (usec): min=41, max=35363, avg=928.78, stdev=2202.54
     lat (usec): min=43, max=35365, avg=930.57, stdev=2202.52
    clat percentiles (usec):
     |  1.00th=[  149],  5.00th=[  175], 10.00th=[  189], 20.00th=[  197],
     | 30.00th=[  205], 40.00th=[  213], 50.00th=[  225], 60.00th=[  237],
     | 70.00th=[  241], 80.00th=[  249], 90.00th=[  532], 95.00th=[ 7776],
     | 99.00th=[ 7968], 99.50th=[ 8032], 99.90th=[ 8384], 99.95th=[ 9792],
     | 99.99th=[12608]
    lat (usec) : 50=0.06%, 100=0.05%, 250=80.25%, 500=9.34%, 750=0.84%
    lat (usec) : 1000=0.10%
    lat (msec) : 2=0.07%, 4=0.02%, 10=9.23%, 20=0.04%, 50=0.01%
  cpu          : usr=0.21%, sys=1.53%, ctx=60197, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=120.6%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=64502,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=16.9MiB/s (17.7MB/s), 16.9MiB/s-16.9MiB/s (17.7MB/s-17.7MB/s), io=252MiB (264MB), run=15008-15008msec

Disk stats (read/write):
  nvme1n1: ios=77781/3, merge=0/1, ticks=67511/10, in_queue=67520, util=99.41%


Testing Write Latency...
write_latency: (g=0): rw=randwrite, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=4
fio-2.17-45-g06cb
Starting 1 process

write_latency: (groupid=0, jobs=1): err= 0: pid=61: Sat May  6 06:04:27 2023
  write: IOPS=4298, BW=16.9MiB/s (17.7MB/s)(252MiB/15006msec)
    slat (usec): min=1, max=2430, avg= 2.19, stdev= 9.01
    clat (usec): min=15, max=15157, avg=928.38, stdev=2645.11
     lat (usec): min=69, max=15160, avg=930.59, stdev=2645.05
    clat percentiles (usec):
     |  1.00th=[   70],  5.00th=[   72], 10.00th=[   73], 20.00th=[   74],
     | 30.00th=[   75], 40.00th=[   77], 50.00th=[   78], 60.00th=[   80],
     | 70.00th=[   82], 80.00th=[   87], 90.00th=[  239], 95.00th=[ 9152],
     | 99.00th=[ 9280], 99.50th=[ 9280], 99.90th=[ 9536], 99.95th=[10176],
     | 99.99th=[14272]
    lat (usec) : 20=0.01%, 50=0.01%, 100=87.94%, 250=2.11%, 500=0.53%
    lat (usec) : 750=0.07%, 1000=0.01%
    lat (msec) : 2=0.02%, 4=0.02%, 10=9.24%, 20=0.05%
  cpu          : usr=0.60%, sys=1.21%, ctx=53491, majf=0, minf=3
  IO depths    : 1=0.1%, 2=0.1%, 4=116.2%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,64496,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=16.9MiB/s (17.7MB/s), 16.9MiB/s-16.9MiB/s (17.7MB/s-17.7MB/s), io=252MiB (264MB), run=15006-15006msec

Disk stats (read/write):
  nvme1n1: ios=3/73885, merge=0/3, ticks=5/66396, in_queue=66400, util=99.39%


Testing Read Sequential Speed...
read_seq: (g=0): rw=read, bs=1024KiB-1024KiB,1024KiB-1024KiB,1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
fio-2.17-45-g06cb
Starting 4 threads
read_seq: Laying out IO file(s) (1 file(s) / 3548MiB)

read_seq: (groupid=0, jobs=1): err= 0: pid=71: Sat May  6 06:05:10 2023
   read: IOPS=36, BW=37.7MiB/s (39.5MB/s)(615MiB/16358msec)
  cpu          : usr=0.00%, sys=0.10%, ctx=495, majf=0, minf=0
  IO depths    : 1=0.2%, 2=0.3%, 4=0.7%, 8=1.3%, 16=114.5%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=600,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
read_seq: (groupid=0, jobs=1): err= 0: pid=72: Sat May  6 06:05:10 2023
   read: IOPS=34, BW=35.8MiB/s (37.5MB/s)(560MiB/15668msec)
  cpu          : usr=0.02%, sys=0.07%, ctx=445, majf=0, minf=0
  IO depths    : 1=0.2%, 2=0.4%, 4=0.7%, 8=1.5%, 16=114.3%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.8%, 8=0.0%, 16=0.2%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=545,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
read_seq: (groupid=0, jobs=1): err= 0: pid=73: Sat May  6 06:05:10 2023
   read: IOPS=36, BW=37.3MiB/s (39.5MB/s)(621MiB/16678msec)
  cpu          : usr=0.00%, sys=0.10%, ctx=512, majf=0, minf=0
  IO depths    : 1=0.2%, 2=0.3%, 4=0.7%, 8=1.3%, 16=113.4%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=606,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
read_seq: (groupid=0, jobs=1): err= 0: pid=74: Sat May  6 06:05:10 2023
   read: IOPS=36, BW=37.9MiB/s (39.7MB/s)(621MiB/16418msec)
  cpu          : usr=0.04%, sys=0.06%, ctx=504, majf=0, minf=0
  IO depths    : 1=0.2%, 2=0.3%, 4=0.7%, 8=1.3%, 16=113.4%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=606,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=145MiB/s (152MB/s), 35.8MiB/s-37.9MiB/s (37.5MB/s-39.7MB/s), io=2417MiB (2534MB), run=15668-16678msec

Disk stats (read/write):
  nvme1n1: ios=10862/2, merge=0/1, ticks=4507415/559, in_queue=4507973, util=98.83%


Testing Write Sequential Speed...
write_seq: (g=0): rw=write, bs=1024KiB-1024KiB,1024KiB-1024KiB,1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
fio-2.17-45-g06cb
Starting 4 threads

write_seq: (groupid=0, jobs=1): err= 0: pid=84: Sat May  6 06:05:29 2023
  write: IOPS=36, BW=37.2MiB/s (38.1MB/s)(599MiB/16117msec)
  cpu          : usr=0.39%, sys=0.01%, ctx=488, majf=0, minf=0
  IO depths    : 1=0.2%, 2=0.3%, 4=0.7%, 8=1.4%, 16=117.6%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,584,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
write_seq: (groupid=0, jobs=1): err= 0: pid=85: Sat May  6 06:05:29 2023
  write: IOPS=37, BW=38.3MiB/s (40.2MB/s)(616MiB/16107msec)
  cpu          : usr=0.34%, sys=0.07%, ctx=467, majf=0, minf=0
  IO depths    : 1=0.2%, 2=0.3%, 4=0.7%, 8=1.3%, 16=114.3%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,601,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
write_seq: (groupid=0, jobs=1): err= 0: pid=86: Sat May  6 06:05:29 2023
  write: IOPS=34, BW=35.5MiB/s (37.2MB/s)(549MiB/15488msec)
  cpu          : usr=0.25%, sys=0.12%, ctx=426, majf=0, minf=0
  IO depths    : 1=0.2%, 2=0.4%, 4=0.7%, 8=1.5%, 16=116.7%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.8%, 8=0.0%, 16=0.2%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,534,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
write_seq: (groupid=0, jobs=1): err= 0: pid=87: Sat May  6 06:05:29 2023
  write: IOPS=36, BW=37.8MiB/s (39.6MB/s)(620MiB/16418msec)
  cpu          : usr=0.35%, sys=0.04%, ctx=483, majf=0, minf=0
  IO depths    : 1=0.2%, 2=0.3%, 4=0.7%, 8=1.3%, 16=113.6%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,605,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=145MiB/s (152MB/s), 35.5MiB/s-38.3MiB/s (37.2MB/s-40.2MB/s), io=2384MiB (2500MB), run=15488-16418msec

Disk stats (read/write):
  nvme1n1: ios=3/10868, merge=0/3, ticks=697/4315167, in_queue=4315863, util=99.34%


Testing Read/Write Mixed...
rw_mix: (g=0): rw=randrw, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=64
fio-2.17-45-g06cb
Starting 1 process

rw_mix: (groupid=0, jobs=1): err= 0: pid=97: Sat May  6 06:05:46 2023
   read: IOPS=3219, BW=12.7MiB/s (13.3MB/s)(189MiB/15013msec)
  write: IOPS=1078, BW=4314KiB/s (4418kB/s)(63.3MiB/15013msec)
  cpu          : usr=0.19%, sys=1.57%, ctx=58143, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=120.5%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=48330,16185,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=12.7MiB/s (13.3MB/s), 12.7MiB/s-12.7MiB/s (13.3MB/s-13.3MB/s), io=189MiB (198MB), run=15013-15013msec
  WRITE: bw=4314KiB/s (4418kB/s), 4314KiB/s-4314KiB/s (4418kB/s-4418kB/s), io=63.3MiB (66.4MB), run=15013-15013msec

Disk stats (read/write):
  nvme1n1: ios=58314/19479, merge=0/4, ticks=814900/270219, in_queue=1085118, util=99.37%


All tests complete.

==================
= Dbench Summary =
==================
Random Read/Write IOPS: 4293/4295. BW: 145MiB/s / 145MiB/s
Average Latency (usec) Read/Write: 930.57/930.59
Sequential Read/Write: 145MiB/s / 145MiB/s
Mixed Random Read/Write IOPS: 3219/1078